using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Tjuring_Machine_Term_Paper
{
    public partial class HelpForm : Form
    {
        public HelpForm()
        {
            InitializeComponent();
            Tips.Text =
                "В левом нижнем углу программы находится поле ввода, куда можно записать команды для машины Тьюринга\n" +
                "Справа от поля ввода находится контейнер со всеми текстовыми файлами, которые содержатся в той же директории,\n" +
                "что и исполняющий файл. Кликнув на любой файл из списка, его содержимое будет записано в поле ввода.\n" +
                "Команды выглядят следующим образом:\n" +
                "q[буквы и цифры] [буква алфавита] -> q[буквы и цифры] [буква алфавита] [направление]\n" +
                "Например: qMyState1 # -> qMyState2 0 R\n" +
                "Эта инструкция означает, что если машина находится в состоянии qMyState1\n" +
                "и указывает на пробел (#), то она перейдет в состояние qMyState2, вместо пробела запишет 0 и перейдет\n" +
                "на одну ячейку вправо." +
                "Для перемещения указателя нужно использовать буквы r (R), l (L), s (S)\n" +
                "Если не будет указано никакой буквы, регистрация команд завершится аварийно\n" +
                "Указатель на ленте можно менять двойным кликом по белой клетке или стрелками с направлениями 'право' и 'лево'.\n" +
                "В ленту, когда она активирована, можно вводить слова, состоящие из цифр и латинских букв.\n" +
                "Команда 'One step' совершит один шаг машины Тьюринга согласно прописанным командам.\n" +
                "Команда 'Total' закончит работу машины либо при переходе в состояние 'q0', либо при аварийном завершении.\n" +
                "Кнопка 'Reset state' сбросит текущее состояние до состояния по умолчанию ('q1').\n" +
                "Кнопка 'Save' сохранит набранный набор инструкций в текстовый файл и поместит его туда же,\n" +
                "где находится исполняющий.\n";
            Width = Tips.Width + 36;
        }

        private void OKButton_Click(object sender, EventArgs e)
        {
            Close();
        }
    }
}
